jpiskovsky/Ledky/Ledky - MIT 4.A/STM8S-toolchain-main/inc/main.h
#ifndef _MAIN_H_
#define _MAIN_H_ 1

#define LOW(BAGR) GPIO_WriteLow(BAGR##_PORT, BAGR##_PIN)
#define HIGH(BAGR) GPIO_WriteHigh(BAGR##_PORT, BAGR##_PIN)
#define REVERSE(BAGR) GPIO_WriteReverse(BAGR##_PORT, BAGR##_PIN)

#define READ(BAGR) (GPIO_ReadInputPin(BAGR##_PORT, BAGR##_PIN)!=RESET) 
#define PUSH(BAGR) (GPIO_ReadInputPin(BAGR##_PORT, BAGR##_PIN)==RESET) 

// Discovery Board
#ifdef STM8S003
#define LED_PORT GPIOD
#define LED_PIN  GPIO_PIN_0
#define BTN_PORT GPIOB
#define BTN_PIN  GPIO_PIN_7
#endif

// Dero Board
#ifdef STM8S103
#define LED_PORT GPIOD
#define LED_PIN  GPIO_PIN_4
#endif

// Discovery Board
#ifdef STM8S105
#define LED_PORT GPIOD
#define LED_PIN  GPIO_PIN_0
#endif

// Nucleo Kit
#ifdef STM8S208
#define BTN1_PORT GPIOE
#define BTN1_PIN  GPIO_PIN_4
#define LED1_PORT GPIOB
#define LED1_PIN GPIO_PIN_1
#define LED2_PORT GPIOB
#define LED2_PIN GPIO_PIN_2
#define LED3_PORT GPIOB
#define LED3_PIN GPIO_PIN_3
#define LED4_PORT GPIOB
#define LED4_PIN GPIO_PIN_4
#endif

// functions
void init(void);

#endif // !_MAIN_H_
